export const frontendInfo = [
  {
    title: 'Список элементов',
    body: 'Выводим минимум 1 список элементов, полученных от сервера через GET запрос'
  },
  {
    title: 'Форма отправки',
    body: 'Реализовать минимум 2 формы для отправки данных на сервер через POST запрос'
  },
  {
    title: 'Страницы',
    body: 'Всего минимум 3 страницы на сайте, реализованных с помощью React Router'
  },
  {
    title: 'Страница одного элемента',
    body: 'Страница получает и выводит информацию с сервера через GET запрос по параметру из URL. '
  },
  {
    title: 'Приватные страницы',
    body: 'Страницы, доступные только авторизованным пользователям Private Routes'
  },
  {
    title: 'Использование библиотеки для управления состоянием',
    body: 'Использование Redux в проекте.'
  },
  {
    title: 'Редактирование элементов',
    body: 'Возможность обновить данные на сервере через PUT/PATCH запросы'
  },
  {
    title: 'Удаление элементов',
    body: 'Возможность удалять данные на сервере через DELETE запрос'
  },
  {
    title: 'Кастомные хуки',
    body: 'Реализовать минимум 1 собственный хук React Hooks'
  },
  {
    title: 'Загрузка...',
    body: 'При любом ожидании пользователя должен появляться индикатор загрузки Loader'
  }
]
export const backendInfo = [
  {
    title: 'Настройка Express',
    body: 'С помощью Express нужно добавить все роуты, необходимые приложению для работы по REST API.'
  },
  {
    title: 'Все виды запросов',
    body: 'Минимум 1 раз реализовать работу с каждым из запросов: GET, POST, PUT и/или PATCH, DELETE'
  },
  {
    title: 'Использование промежуточных обработчиков',
    body: 'Необходимо добавить минимум 1 кастомный middleware в проект.'
  },
  {
    title: 'Модели mongoose',
    body: 'Страница получает и выводит информацию с сервера через GET запрос по параметру из URL.'
  },
  {
    title: 'Авторизация и регистрация',
    body: 'Функционал создания аккаунта и входа в него. Использовать для этого JSON Web Token (JWT)'
  }
]
export const additionalInfo = [
  {
    title: 'Комментарии',
    body: 'Возможность оставлять комментарии к статьям, удалять только свои. Админ имеет полный доступ'
  },
  {
    title: 'Сортировка',
    body: 'Сортировка данных в таблице'
  },
  {
    title: 'Поиск статей',
    body: 'Поиск `налету` из слов в поле поиска'
  },
  {
    title: 'Пагинация',
    body: 'Пагинация страниц'
  },
  {
    title: 'Оставаться в системе',
    body: 'Кликнув по данной галочке - время жизни токенов увеличивается'
  },
  {
    title: 'HOC',
    body: 'Использование компоненты высшего порядка'
  }
]